export default {
  projections: {
    ЗаказE: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      бокс: {
        __caption__: 'Бокс',
        номерБокса: {
          __caption__: 'Номер бокса'
        }
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      клиент: {
        __caption__: 'Клиент',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      составЗаказа: {
        __caption__: 'Состав заказа',
        услуга: {
          __caption__: 'Услуга',
          наименование: {
            __caption__: 'Наименование'
          }
        }
      }
    },
    ЗаказL: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      бокс: {
        __caption__: 'Номер бокса',
        номерБокса: {
          __caption__: 'Номер бокса'
        }
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      клиент: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    время: {
      __caption__: 'Время'
    },
    дата: {
      __caption__: 'Дата'
    },
    кодЗаказа: {
      __caption__: 'Код заказа'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    типОплаты: {
      __caption__: 'Тип оплаты'
    },
    бокс: {
      __caption__: 'Бокс'
    },
    клиент: {
      __caption__: 'Клиент'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    },
    составЗаказа: {
      __caption__: 'Состав заказа'
    }
  }
};
